

<!DOCTYPE html>
<html lang="">
<head prefix="og: http://ogp.me/ns#"><meta name="generator" content="Hexo 3.8.0">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="">
    <title>projects_url | c1y2m3’blog</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x5317;&amp;#x6F02;&amp;#x5C0F;&amp;#x8BB0; &amp;#x6211;&amp;#x8BA8;&amp;#x538C;&amp;#x6BCF;&amp;#x5929;&amp;#x4E00;&amp;#x6210;&amp;#x4E0D;&amp;#x53D8;&amp;#x7684;&amp;#x4E8B;&amp;#x7269;&amp;#xFF0C;&amp;#x6211;&amp;#x7684;&amp;#x684C;&amp;#x9762;&amp;#x58C1;&amp;#x7EB8;&amp;#x6BCF;&amp;#x5C0F">
<meta property="og:type" content="website">
<meta property="og:title" content="projects_url">
<meta property="og:url" content="http://yoursite.com/projects_url/index.html">
<meta property="og:site_name" content="c1y2m3’blog">
<meta property="og:description" content="&amp;#x5317;&amp;#x6F02;&amp;#x5C0F;&amp;#x8BB0; &amp;#x6211;&amp;#x8BA8;&amp;#x538C;&amp;#x6BCF;&amp;#x5929;&amp;#x4E00;&amp;#x6210;&amp;#x4E0D;&amp;#x53D8;&amp;#x7684;&amp;#x4E8B;&amp;#x7269;&amp;#xFF0C;&amp;#x6211;&amp;#x7684;&amp;#x684C;&amp;#x9762;&amp;#x58C1;&amp;#x7EB8;&amp;#x6BCF;&amp;#x5C0F">
<meta property="og:locale" content="default">
<meta property="og:image" content="https://2kb.me/wp-content/uploads/2018/04/QQ%E5%9B%BE%E7%89%8720180404204718.png">
<meta property="og:updated_time" content="2019-01-21T14:00:53.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="projects_url">
<meta name="twitter:description" content="&amp;#x5317;&amp;#x6F02;&amp;#x5C0F;&amp;#x8BB0; &amp;#x6211;&amp;#x8BA8;&amp;#x538C;&amp;#x6BCF;&amp;#x5929;&amp;#x4E00;&amp;#x6210;&amp;#x4E0D;&amp;#x53D8;&amp;#x7684;&amp;#x4E8B;&amp;#x7269;&amp;#xFF0C;&amp;#x6211;&amp;#x7684;&amp;#x684C;&amp;#x9762;&amp;#x58C1;&amp;#x7EB8;&amp;#x6BCF;&amp;#x5C0F">
<meta name="twitter:image" content="https://2kb.me/wp-content/uploads/2018/04/QQ%E5%9B%BE%E7%89%8720180404204718.png">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "John Doe",
  "url": "http://yoursite.com"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/c1y2m3.github.io/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>c1y2m3’blog</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/c1y2m3.github.io/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">John Doe</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item">
        <i class="home icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        
<article id="page">
  <h1>projects_url</h1>
  <h1 id="&#x5317;&#x6F02;&#x5C0F;&#x8BB0;"><a href="#&#x5317;&#x6F02;&#x5C0F;&#x8BB0;" class="headerlink" title="&#x5317;&#x6F02;&#x5C0F;&#x8BB0;"></a>&#x5317;&#x6F02;&#x5C0F;&#x8BB0;</h1><p> &#x6211;&#x8BA8;&#x538C;&#x6BCF;&#x5929;&#x4E00;&#x6210;&#x4E0D;&#x53D8;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x6211;&#x7684;&#x684C;&#x9762;&#x58C1;&#x7EB8;&#x6BCF;&#x5C0F;&#x65F6;&#x90FD;&#x5728;&#x53D8;&#xFF0C;&#x6211;&#x7684;&#x65E9;&#x9910;&#x6BCF;&#x5929;&#x5403;&#x7684;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5374;&#x6CA1;&#x6CD5;&#x9003;&#x907F;&#x6BCF;&#x5929;&#x8981;&#x505A;&#x7740;&#x91CD;&#x590D;&#x7684;&#x4E8B;&#x3002;&#x91CD;&#x590D;&#x7684;&#x4E0D;&#x65E9;&#x8D77;&#xFF0C;&#x91CD;&#x590D;&#x7684;&#x6BCF;&#x5929;&#x67E5;&#x770B;&#x90AE;&#x7BB1;&#xFF0C;&#x91CD;&#x590D;&#x7684;&#x6D4F;&#x89C8;&#x4E00;&#x4E9B;wiki&#x7F51;&#x7AD9;&#xFF0C;&#x7EE7;&#x7EED;&#x770B;&#x4E00;&#x672C;&#x6CA1;&#x770B;&#x5B8C;&#x7684;&#x4E66;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x4E8B;&#xFF0C;&#x6BCF;&#x5929;&#x7684;&#x5929;&#x6C14;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x6BCF;&#x5929;&#x6536;&#x5230;&#x7684;&#x90AE;&#x4EF6;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x6BCF;&#x5929;wiki&#x4E0A;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4E66;&#x4E0A;&#x7684;&#x5185;&#x5BB9;&#x6BCF;&#x7AE0;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<p> &#x8C28;&#x4EE5;&#x6B64;&#x6587;&#xFF0C;&#x7EAA;&#x5FF5;&#x6211;&#x79BB;&#x5F00;&#x5BB6;&#x4E61;&#x7684;&#x65E5;&#x5B50;&#x548C;&#x5317;&#x6F02;&#x751F;&#x6D3B;&#x7684;&#x5F00;&#x59CB;&#x3002;</p>
<h1 id="2018-12-6"><a href="#2018-12-6" class="headerlink" title="2018.12.6"></a>2018.12.6</h1><p>&#x81EA;&#x4E0A;&#x6B21;&#x5DF2;&#x7ECF;&#x597D;&#x4E45;&#x6CA1;&#x66F4;&#x65B0;&#x4E86;&#xFF0C;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x7ECF;&#x5386;&#x4E00;&#x53E5;&#x8BDD;&#x4E5F;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#x3002;</p>
<p>11&#x6708;&#x521D;&#x79BB;&#x5F00;&#x4E86;&#x5317;&#x4EAC;&#xFF0C;&#x6765;&#x5230;&#x4E86;&#x9B54;&#x90FD;(&#x770B;&#x4E86;&#x4E24;&#x5929;&#x7684;&#x623F;&#x5B50;&#xFF0C;&#x624D;&#x5B9A;&#x4E0B;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x70B9;&#x72FC;&#x72C8;)&#xFF0C;&#x771F;&#x8981;&#x79BB;&#x5F00;&#x7ADF;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x820D;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x662F;&#x5317;&#x4EAC;&#xFF0C;&#x6709;&#x7740;&#x4E94;&#x5F69;&#x6591;&#x9611;&#x7684;&#x673A;&#x4F1A;&#x548C;&#x65E0;&#x9650;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x6709;&#x592A;&#x591A;&#x6BD4;&#x4F60;&#x8FD8;&#x8981;&#x52AA;&#x529B;&#x7684;&#x4EBA;&#x5728;&#x62FC;&#x640F;&#xFF0C;&#x4E5F;&#x8BA4;&#x8BC6;&#x4E86;&#x5F88;&#x591A;&#x5FD7;&#x540C;&#x9053;&#x5408;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x6700;&#x5F00;&#x5FC3;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x867D;&#x7136;&#x5982;&#x4ECA;&#x5404;&#x5954;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x8FC7;&#x7684;&#x66F4;&#x597D;&#xFF01; </p>
<p>&#x65F6;&#x9694;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x6211;&#xFF0C;&#x4E5F;&#x5F00;&#x59CB;&#x627E;&#x8D77;&#x4E86;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BDD;&#x8BF4;&#x7B2C;&#x4E00;&#x6B21;&#x9762;&#x8BD5;&#x633A;&#x7D27;&#x5F20;&#x7684;&#xFF0C;&#x624B;&#x90FD;&#x5728;&#x98A4;&#x6296;&#xFF0C;&#x96BE;&#x514D;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x561B;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x54C8;&#xFF0C; &#x5230;&#x540E;&#x9762;&#x53D1;&#x73B0; &#x8D8A;&#x9762;&#x8D8A;&#x597D;&#x73A9;&#x4E86;&#xFF0C;&#x611F;&#x89C9;&#x5C31;&#x8DDF;&#x56DE;&#x5BB6;&#x4E86;&#x4E00;&#x6837;&#x2026;(&#x539F;&#x8C05;&#x6211;&#x76AE;&#x4E00;&#x4E0B;) &#x4E5F;&#x5F88;&#x8C22;&#x8C22;&#x9762;&#x8BD5;&#x5B98;&#x7ED9;&#x6211;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5728;&#x6D3D;&#x8C08;&#x4E2D;&#x7ED9;&#x4E86;&#x6211;&#x5F88;&#x591A;&#x65B9;&#x5411;&#xFF0C;&#x8BA9;&#x6211;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x5B9A;&#x4F4D;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x5173;&#x4E8E;Web&#x65B9;&#x9762;&#xFF0C;&#x8981;&#x5B66;&#x7684;&#x8FD8;&#x662F;&#x5F88;&#x591A;&#x7684;&#xFF0C;&#x77E5;&#x8BC6;&#x9762;&#x592A;&#x5E7F;&#x4E86;&#xFF0C;&#x5230;&#x5934;&#x6765;&#xFF0C;&#x5B66;&#x4E60;&#x8D8A;&#x591A;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x8D8A;&#x6E3A;&#x5C0F;&#xFF0C;&#x4E0D;&#x4F1A;&#x7684;&#x5F88;&#x591A;&#xFF0C;&#x4F1A;&#x7684;&#x53C8;&#x53EA;&#x662F;&#x76AE;&#x6BDB;&#xFF0C;(&#x867D;&#x7136;&#x6211;&#x672C;&#x6765;&#x5C31;&#x6BD4;&#x8F83;&#x83DC;) &#x4F46;&#x8FD8;&#x662F;&#x8981;&#x9759;&#x4E0B;&#x5FC3;&#x6765;&#x597D;&#x597D;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x80FD;&#x6D6E;&#x8E81;&#xFF0C;&#x591A;&#x7EC3;&#x3002;</p>
<p>&#x6BCF;&#x5929;&#x575A;&#x6301;&#x770B; &#x4E4C;&#x4E91;&#x77E5;&#x8BC6;&#x5E93;&#xFF0C;wiki&#xFF0C;&#x591A;&#x5199;&#x7B14;&#x8BB0;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4E5F;&#x8981;&#x597D;&#x597D;&#x62BD;&#x7A7A;&#x628A;&#x4EE3;&#x7801;&#x7EC3;&#x719F;&#xFF0C;&#x4E0D;&#x8BA9;&#x81EA;&#x5DF1;&#x592A;&#x5C40;&#x9650;&#xFF0C;&#x7279;&#x522B;&#x662F;python&#xFF0C;&#x6B64;&#x6B21;&#x662F;php,&#x54CE;&#xFF0C;&#x8BF4;&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x5C31;&#x6709;&#x70B9;&#x61F5;&#x903C;&#x4E86;&#x3002;&#x3002;&#x3002;<br>&#x4E00;&#x5B9A;&#x8981;&#x591A;&#x7EC3;&#xFF0C; &#x4E0D;&#x80FD;&#x5149;&#x8BF4;&#x4E0D;&#x7EC3;&#x5047;&#x628A;&#x5F0F;&#xFF01; </p>
<p>&#x6BCF;&#x5929;&#x7EC3;&#x4E00;&#x70B9;&#xFF0C;&#x79EF;&#x7D2F;&#xFF0C;&#x6C89;&#x6DC0;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x6211;&#x7684;&#x52AA;&#x529B;&#x4E0D;&#x4F1A;&#x767D;&#x8D39;&#x3002; </p>
<p>&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x4E00;&#x76F4;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x7231;&#x597D;&#xFF0C;&#x6211;&#x5F88;&#x5E86;&#x5E78;&#x81EA;&#x5DF1;&#x80FD;&#x628A;&#x7231;&#x597D;&#x53D8;&#x6210;&#x5DE5;&#x4F5C;&#xFF0C;</p>
<p>&#x611F;&#x8C22;&#x4F60;&#x4EEC;&#x3002;</p>
<h1 id="2018-12-08"><a href="#2018-12-08" class="headerlink" title="2018.12.08"></a>2018.12.08</h1><p>&#x6211;&#x53C8;&#x4E00;&#x6B21;&#x9009;&#x62E9;&#x53BB;&#x4E00;&#x4E2A;&#x79BB;&#x5BB6;&#x5F88;&#x8FDC;&#x7684;&#x5730;&#x65B9;(&#x5317;&#x4EAC;)&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x4F60;&#x662F;&#x5728;&#x8FFD;&#x9010;&#x81EA;&#x5DF1;&#x7684;&#x68A6;&#xFF0C;&#x6211;&#x8BF4;&#x6211;&#x73B0;&#x5728;&#x53EA;&#x662F;&#x5728;&#x4E30;&#x5BCC;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x751F;&#x3002;</p>
<p>12.08&#x65E9;&#xFF0C;&#x4E58;&#x9AD8;&#x94C1;&#x79BB;&#x5F00;&#x4E0A;&#x6D77;&#xFF0C;&#x98DE;&#x673A;&#x843D;&#x5730;&#x7684;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x6211;&#x6B63;&#x5728;&#x7684;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x540D;&#x5317;&#x6F02;&#x4E4B;&#x5B50;&#x3002;&#x51FA;&#x7AD9;&#x7684;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x98CE;&#x5439;&#x5728;&#x8138;&#x4E0A;&#xFF0C;&#x611F;&#x89C9;&#x683C;&#x5916;&#x7684;&#x523A;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x6811;&#x5927;&#x591A;&#x90FD;&#x662F;&#x6B8B;&#x679D;&#x3002; &#x63D0;&#x524D;&#x548C;&#x81EA;&#x5982;&#x4E2D;&#x4ECB;&#x9884;&#x7EA6;&#x4E86;&#x770B;&#x623F;&#xFF0C;&#x5E86;&#x5174;&#x7684;&#x662F;&#x670B;&#x53CB;&#x6765;&#x63A5;&#x6211;&#xFF0C;&#x966A;&#x6211;&#x4E00;&#x8D77;&#x770B;&#x4E86;&#x623F;&#x5B50;&#xFF0C;&#x5DF2;&#x7ECF;&#x51B7;&#x7684;&#x4E0D;&#x884C;&#x4E86;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E00;&#x5C0F;&#x65F6;&#x5185;&#x5FC3;&#x6323;&#x624E;&#xFF0C;&#x5728;&#x56DE;&#x9F99;&#x89C2;&#x79DF;&#x4E0B;&#x4E86;&#xFF0C;&#x79BB;&#x516C;&#x53F8;&#x5F88;&#x7B97;&#x8FD1;&#xFF0C;&#x665A;&#x4E0A;&#x548C;&#x4EE5;&#x524D;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x805A;&#x4E86;&#x4E2A;&#x9910;&#xFF0C;&#x559D;&#x4E86;&#x70B9;&#x5C0F;&#x9152;&#xFF0C;&#x8C08;&#x8C08;&#x5DE5;&#x4F5C;&#x65E5;&#x5E38;&#xFF0C;&#x633A;&#x5F00;&#x5FC3;&#x7684;&#x3002;</p>
<p>&#x665A;&#x4E0A;&#x901B;&#x4E86;&#x901B;&#x8D85;&#x5E02;&#xFF0C;&#x52C9;&#x5F3A;&#x628A;&#x751F;&#x6D3B;&#x7528;&#x54C1;&#x4E70;&#x9F50;&#x4E86;(&#x592A;&#x665A;&#x4E86;)&#xFF0C;&#x5F53;&#x5929;&#x665A;&#x4E0A;&#x6696;&#x6C14;&#xFF0C;&#x7A7A;&#x8C03;&#x52C9;&#x5F3A;&#x80FD;&#x7528;&#xFF0C;&#x6709;&#x70B9;&#x51B7;&#xFF0C;&#x6CA1;&#x6562;&#x9732;&#x5934;&#x3002;</p>
<p>2018.12.10&#x65E9;&#xFF0C;&#x65E9;&#x4E0A;&#x6324;&#x4E86;&#x4E00;&#x8D9F;&#x65E9;&#x9AD8;&#x5CF0;&#x534A;&#x5C0F;&#x65F6;&#x6765;&#x5230;&#x4E86;&#x516C;&#x53F8;&#xFF0C;&#x5165;&#x804C;&#x3002;&#x6B64;&#x523B;&#x5199;&#x4E0B;&#x6B64;&#x6587;&#x3002;</p>
<p><a class="magnific-img" href="https://2kb.me/wp-content/uploads/2018/04/QQ%E5%9B%BE%E7%89%8720180404204718.png"><img src="https://2kb.me/wp-content/uploads/2018/04/QQ%E5%9B%BE%E7%89%8720180404204718.png" alt="" class="ui centered image"></a><br>                            -2018.12.6</p>

</article>

                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2019 <a href="/">John Doe</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/c1y2m3.github.io/js/semantic-ui-algolia.js"></script>

<script src="/c1y2m3.github.io/js/aloha-events.js"></script>



</body>
</html>
